const { Bot, InlineKeyboard } = require("grammy");


// Создаём объект бота
const bot = new Bot("8242094324:AAHMatw9XhDaiC7TXXetPLB33EPpzXSCRQ0"); // <-- place your bot token in this string

const userStat = [];

// Функция для приветствия пользователя
bot.command('start', async (ctx) => {
    saveUser(ctx.from.id)

    let userName = ctx.from.first_name || 'Пользователь';
    await ctx.reply("Привет, "+userName+"! Я бот 🤖, который может разворачивать текстовые сообщения и отвечать на команды.", { reply_markup: menuKeyboard });
    console.log("Приветствие отправлено пользователю: " + userName);
});

bot.command('history', (ctx) => {

})

// Функция для команды /help
bot.command('help', async (ctx) => {
    const helpMessage =
        `Доступные команды:
        /start: Приветствие и описание возможностей бота
        /history: выводит пять последних вопросов
        /help: Список доступных команд
        ;`
    await ctx.reply(helpMessage);
    console.log('Пользователь запросил помощь.');
});

function answerQuestion(question) {
    const answers = ["Да, это вполне вероятно", "Безусловно, такое может произойти", "Шансы очень высоки", "Всё к этому идёт", "Это более чем реально", "Да, при текущих условиях это ожидаемо", "Вероятность близка к стопроцентной", "Все предпосылки для этого есть", "Шансы пятьдесят на пятьдесят", "Вполне возможно, но не факт", "Исход неочевиден, может случиться по-разному", "Вероятность существует, но она невелика", "Слишком много переменных, чтобы дать точный прогноз", "Это не предопределено, но и исключать нельзя", "Вероятность есть, как и вероятность альтернативного сценария", "Случиться может, а может и нет", "Крайне маловероятно", "Нет, предпосылок для этого не наблюдается", "Вероятность стремится к нулю", "Скорее всего, этого не произойдёт"]


    return answers[Math.floor(Math.random() * 20)]
}

// Функция для обработки текстовых сообщений
bot.on('message:text', async (ctx) => {
    const userMessage = ctx.message.text.trim();

    // Если сообщение начинается с "/" - это команда
    if (userMessage.startsWith('/')) {
        // Неизвестная команда
        await ctx.reply('Неизвестная команда. Используйте /help для списка доступных команд.');
        console.log("Неизвестная команда от пользователя: " + userMessage);
        return;
    }

    if (userMessage.length === 0) {
        await ctx.reply('Пожалуйста, введите вопрос.');
        console.log('Пользователь отправил пустое сообщение или только пробелы.');
    } else {

        if (userMessage.endsWith("?")) {
            ctx.reply(answerQuestion())
        }else {
            ctx.reply('Пожалуйста, введите вопрос.')
        }
        
        await ctx.reply();
        console.log();
    }
})


const menuKeyboard = new InlineKeyboard()
    .text("Задать вопрос", "ask_question")
    .text("История", "history")

bot.callbackQuery('ask_question', (ctx) => {
    ctx.deleteMessage();
    ctx.answerCallbackQuery();
    ctx.reply("Задайте вопрос: ");
})



bot.callbackQuery('statistic', (ctx) => {
    ctx.deleteMessage();
    ctx.answerCallbackQuery();

    let user = userStat.get(ctx.from.id)

    ctx.reply(`Побед: ${user.wins}, Поражений: ${user.loses}`);
})


// Обработка ошибок
bot.catch((err) => {
    console.error('Произошла ошибка:', err);
})



function saveUser(user_id) {

if (userStat.get(user_id)) return;
    userStat.set(user_id, { wins: 0, loses: 0 })

    console.log('Пользователь сохранён: ', userStat)
}

function updateUserHistory(user_id, question) {
    if(!userStat.get(user_id)) saveUser(user_id);

    let user = userStat.get(user_id)
    if (userStat.length() == 5) {
        let temp1 = userStat[1]
        let temp2 = userStat[2]
        let temp3 = userStat[3]
        let temp4 = userStat[4]

        userStat[0] = temp1
        userStat[1] = temp2
        userStat[2] = temp3
        userStat[3] = temp4

        userStat[4] = question
    }
    userStat.add(question)
}

// Запуск бота
bot.start();
console.log('Бот запущен и ожидает сообщения...');